1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?
Хочу научиться работать с MySQL, конкретных вопросов на данный момент нет.
2) В какой сфере работаете сейчас?
Заканчиваю магистратуру по специальности "радиофизика", хочу свзять свою жизнь с IT.
3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?
Есть небольшой в IT, полученный во время прохождения практики в научно-исследовательском институте. 
Использовала язык Python и процедурное программирование для визуализации и анализа данных коррелятора RASFX.